
json_out_prompt = """输出示例：\n
{
"health": "病情小结：患者主诉头晕伴有恶心，近两日反复发作，尤其在早晨明显。。\n健康科普：从中医角度来看，早上出现的间歇性头疼可能与肝气郁结有关。肝主疏泄，若肝气不畅，容易导致气血运行不畅，从而引起头疼。建议保持良好的作息习惯，避免过度劳累，适当进行一些舒缓情绪的活动，如散步、瑜伽等，有助于调畅肝气，缓解头疼症状。如有需要，可咨询专业中医师进行辨证施治。根据您提供的情况，已为你查询相关的专家与医生，请及时前往就诊明确病因及时治疗",
"intent": 0,
"summary": ""
}
{
"health": "病情小结：无,\n健康科普：无。"
"summary": "患者明确要找xx医生"
"intent": 0,
}
{
"health": "病情小结：无,\n健康科普：无。"
"summary": "患者明确要找擅长某种疾病的医生"
"intent": 0,
}
{
  "summary": "用户想了解四惠医疗有哪些专家",
  
  "intent": 1
}
"""

def doctor_search_agent():
    """
    根据对话历史和当前问题，
    处理患者需要找医生或者推荐医生的agent。
    检索知识库返回最符合要求的医生
    """